app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_cart
    begin
      @cart = Cart.find(params[:id])