app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find (params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "13"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 23 Jul 2013 08:20:59 UTC +00:00], ["updated_at", Tue, 23 Jul 2013 08:20:59 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 7], ["created_at", Tue, 23 Jul 2013 08:30:50 UTC +00:00], ["product_id", 13], ["updated_at", Tue, 23 Jul 2013 08:30:50 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 6  [["quantity", 2], ["updated_at", Tue, 23 Jul 2013 23:16:44 UTC +00:00]]