app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc',
      per_page: 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 25]]
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 25]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 04 Aug 2013 13:23:32 UTC +00:00], ["updated_at", Sun, 04 Aug 2013 13:23:32 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 25]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 980190963]]