app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users".name ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "hashed_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 05 Aug 2013 16:41:19 UTC +00:00], ["hashed_password", "123"], ["name", "aaa"], ["salt", "123"], ["updated_at", Mon, 05 Aug 2013 16:41:19 UTC +00:00]]